# Assignment - 4

Question :1
           How to import pandas and check its version

In [ ]:
import pandas as pd

print(pd.__version__)

1.1.4



Question :2 
             How  to create a series from a numpyarray?

In [ ]:
import numpy as np
import pandas as pd

arr = np.array(['1','2','3','4','5','e'])

ser = pd.Series(arr)

print(ser)

0    1
1    2
2    3
3    4
4    5
5    e
dtype: object

Question 3: How to convert index of a series into data frame.

In [ ]:
import pandas as pd
sl = pd.DataFrame ({'Rollno':['101','102','103'],
                    'name':['hello','hi','yo'],
                    'class':['1','2','3'],
                    'marks':[93,91,46]
                    })

sl['index'] = sl.index
sl

  Rollno   name class  marks  index
0    101  hello     1     93      0
1    102     hi     2     91      1
2    103     yo     3     46      2

Question 4:

Write a code to list all the datasets available in seaborn library.Load the 'mpg' dataset

In [3]:
import seaborn as sns

mpg = sns.load_dataset('mpg')

print(mpg)

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
393  27.0          4  ...     usa            ford mustang gl
394  44.0          4  ...  europe                  vw pickup
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[398 rows x 9 columns]

*Question* 5:

Which country origin cars are part of this dataset

In [5]:
import seaborn as sns    

import pandas as pd

mpg = sns.load_dataset('mpg')       #loading the dataset from seaborn

df = pd.DataFrame(mpg)              #creating dataframe

df.origin.unique()                  #disply the origin from where car belong

array(['usa', 'japan', 'europe'], dtype=object)

Question 6:

Exrtract the Dataframe which contains cars belonging  to usa

In [9]:
import seaborn as sns

import pandas as pd

mpg = sns.load_dataset('mpg')

df = pd.DataFrame(mpg)

df[df['origin'].str.contains("usa")]

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
392  27.0          4  ...     usa           chevrolet camaro
393  27.0          4  ...     usa            ford mustang gl
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[249 rows x 9 columns]